SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_exti.h
/**
  * @brief EXTI_RTSR Register Bit Definition
  */
#define  EXTI_RTSR_TR0_Pos                        (0)
#define  EXTI_RTSR_TR0_Msk                        (0x1U << EXTI_RTSR_TR0_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR0                            EXTI_RTSR_TR0_Msk
#define  EXTI_RTSR_TR1_Pos                        (1)
#define  EXTI_RTSR_TR1_Msk                        (0x1U << EXTI_RTSR_TR1_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR1                            EXTI_RTSR_TR1_Msk
#define  EXTI_RTSR_TR2_Pos                        (2)
#define  EXTI_RTSR_TR2_Msk                        (0x1U << EXTI_RTSR_TR2_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR2                            EXTI_RTSR_TR2_Msk
#define  EXTI_RTSR_TR3_Pos                        (3)
#define  EXTI_RTSR_TR3_Msk                        (0x1U << EXTI_RTSR_TR3_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR3                            EXTI_RTSR_TR3_Msk
#define  EXTI_RTSR_TR4_Pos                        (4)
#define  EXTI_RTSR_TR4_Msk                        (0x1U << EXTI_RTSR_TR4_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR4                            EXTI_RTSR_TR4_Msk
#define  EXTI_RTSR_TR5_Pos                        (5)
#define  EXTI_RTSR_TR5_Msk                        (0x1U << EXTI_RTSR_TR5_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR5                            EXTI_RTSR_TR5_Msk
#define  EXTI_RTSR_TR6_Pos                        (6)
#define  EXTI_RTSR_TR6_Msk                        (0x1U << EXTI_RTSR_TR6_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR6                            EXTI_RTSR_TR6_Msk
#define  EXTI_RTSR_TR7_Pos                        (7)
#define  EXTI_RTSR_TR7_Msk                        (0x1U << EXTI_RTSR_TR7_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR7                            EXTI_RTSR_TR7_Msk
#define  EXTI_RTSR_TR8_Pos                        (8)
#define  EXTI_RTSR_TR8_Msk                        (0x1U << EXTI_RTSR_TR8_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR8                            EXTI_RTSR_TR8_Msk
#define  EXTI_RTSR_TR9_Pos                        (9)
#define  EXTI_RTSR_TR9_Msk                        (0x1U << EXTI_RTSR_TR9_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR9                            EXTI_RTSR_TR9_Msk
#define  EXTI_RTSR_TR10_Pos                       (10)
#define  EXTI_RTSR_TR10_Msk                       (0x1U << EXTI_RTSR_TR10_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR10                           EXTI_RTSR_TR10_Msk
#define  EXTI_RTSR_TR11_Pos                       (11)
#define  EXTI_RTSR_TR11_Msk                       (0x1U << EXTI_RTSR_TR11_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR11                           EXTI_RTSR_TR11_Msk
#define  EXTI_RTSR_TR12_Pos                       (12)
#define  EXTI_RTSR_TR12_Msk                       (0x1U << EXTI_RTSR_TR12_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR12                           EXTI_RTSR_TR12_Msk
#define  EXTI_RTSR_TR13_Pos                       (13)
#define  EXTI_RTSR_TR13_Msk                       (0x1U << EXTI_RTSR_TR13_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR13                           EXTI_RTSR_TR13_Msk
#define  EXTI_RTSR_TR14_Pos                       (14)
#define  EXTI_RTSR_TR14_Msk                       (0x1U << EXTI_RTSR_TR14_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR14                           EXTI_RTSR_TR14_Msk
#define  EXTI_RTSR_TR15_Pos                       (15)
#define  EXTI_RTSR_TR15_Msk                       (0x1U << EXTI_RTSR_TR15_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR15                           EXTI_RTSR_TR15_Msk
#define  EXTI_RTSR_TR16_Pos                       (16)
#define  EXTI_RTSR_TR16_Msk                       (0x1U << EXTI_RTSR_TR16_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR16                           EXTI_RTSR_TR16_Msk
#define  EXTI_RTSR_TR17_Pos                       (17)
#define  EXTI_RTSR_TR17_Msk                       (0x1U << EXTI_RTSR_TR17_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR17                           EXTI_RTSR_TR17_Msk
#define  EXTI_RTSR_TR18_Pos                       (18)
#define  EXTI_RTSR_TR18_Msk                       (0x1U << EXTI_RTSR_TR18_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR18                           EXTI_RTSR_TR18_Msk
#define  EXTI_RTSR_TR19_Pos                       (19)
#define  EXTI_RTSR_TR19_Msk                       (0x1U << EXTI_RTSR_TR19_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR19                           EXTI_RTSR_TR19_Msk
#define  EXTI_RTSR_TR20_Pos                       (20)
#define  EXTI_RTSR_TR20_Msk                       (0x1U << EXTI_RTSR_TR20_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR20                           EXTI_RTSR_TR20_Msk
#define  EXTI_RTSR_TR21_Pos                       (21)
#define  EXTI_RTSR_TR21_Msk                       (0x1U << EXTI_RTSR_TR21_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR21                           EXTI_RTSR_TR21_Msk
#define  EXTI_RTSR_TR22_Pos                       (22)
#define  EXTI_RTSR_TR22_Msk                       (0x1U << EXTI_RTSR_TR22_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR22                           EXTI_RTSR_TR22_Msk
#define  EXTI_RTSR_TR23_Pos                       (23)
#define  EXTI_RTSR_TR23_Msk                       (0x1U << EXTI_RTSR_TR23_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR23                           EXTI_RTSR_TR23_Msk
#define  EXTI_RTSR_TR24_Pos                       (24)
#define  EXTI_RTSR_TR24_Msk                       (0x1U << EXTI_RTSR_TR24_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR24                           EXTI_RTSR_TR24_Msk
#define  EXTI_RTSR_TR25_Pos                       (25)
#define  EXTI_RTSR_TR25_Msk                       (0x1U << EXTI_RTSR_TR25_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR25                           EXTI_RTSR_TR25_Msk
#define  EXTI_RTSR_TR26_Pos                       (26)
#define  EXTI_RTSR_TR26_Msk                       (0x1U << EXTI_RTSR_TR26_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR26                           EXTI_RTSR_TR26_Msk
#define  EXTI_RTSR_TR27_Pos                       (27)
#define  EXTI_RTSR_TR27_Msk                       (0x1U << EXTI_RTSR_TR27_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR27                           EXTI_RTSR_TR27_Msk
#define  EXTI_RTSR_TR28_Pos                       (28)
#define  EXTI_RTSR_TR28_Msk                       (0x1U << EXTI_RTSR_TR28_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR28                           EXTI_RTSR_TR28_Msk
#define  EXTI_RTSR_TR29_Pos                       (29)
#define  EXTI_RTSR_TR29_Msk                       (0x1U << EXTI_RTSR_TR29_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR29                           EXTI_RTSR_TR29_Msk
#define  EXTI_RTSR_TR30_Pos                       (30)
#define  EXTI_RTSR_TR30_Msk                       (0x1U << EXTI_RTSR_TR30_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR30                           EXTI_RTSR_TR30_Msk
#define  EXTI_RTSR_TR31_Pos                       (31)
#define  EXTI_RTSR_TR31_Msk                       (0x1U << EXTI_RTSR_TR31_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_RTSR_TR31                           EXTI_RTSR_TR31_Msk

/**
  * @brief EXTI_FTSR Register Bit Definition
  */
#define  EXTI_FTSR_TR0_Pos                        (0)
#define  EXTI_FTSR_TR0_Msk                        (0x1U << EXTI_FTSR_TR0_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR0                            EXTI_FTSR_TR0_Msk
#define  EXTI_FTSR_TR1_Pos                        (1)
#define  EXTI_FTSR_TR1_Msk                        (0x1U << EXTI_FTSR_TR1_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR1                            EXTI_FTSR_TR1_Msk
#define  EXTI_FTSR_TR2_Pos                        (2)
#define  EXTI_FTSR_TR2_Msk                        (0x1U << EXTI_FTSR_TR2_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR2                            EXTI_FTSR_TR2_Msk
#define  EXTI_FTSR_TR3_Pos                        (3)
#define  EXTI_FTSR_TR3_Msk                        (0x1U << EXTI_FTSR_TR3_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR3                            EXTI_FTSR_TR3_Msk
#define  EXTI_FTSR_TR4_Pos                        (4)
#define  EXTI_FTSR_TR4_Msk                        (0x1U << EXTI_FTSR_TR4_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR4                            EXTI_FTSR_TR4_Msk
#define  EXTI_FTSR_TR5_Pos                        (5)
#define  EXTI_FTSR_TR5_Msk                        (0x1U << EXTI_FTSR_TR5_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR5                            EXTI_FTSR_TR5_Msk
#define  EXTI_FTSR_TR6_Pos                        (6)
#define  EXTI_FTSR_TR6_Msk                        (0x1U << EXTI_FTSR_TR6_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR6                            EXTI_FTSR_TR6_Msk
#define  EXTI_FTSR_TR7_Pos                        (7)
#define  EXTI_FTSR_TR7_Msk                        (0x1U << EXTI_FTSR_TR7_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR7                            EXTI_FTSR_TR7_Msk
#define  EXTI_FTSR_TR8_Pos                        (8)
#define  EXTI_FTSR_TR8_Msk                        (0x1U << EXTI_FTSR_TR8_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR8                            EXTI_FTSR_TR8_Msk
#define  EXTI_FTSR_TR9_Pos                        (9)
#define  EXTI_FTSR_TR9_Msk                        (0x1U << EXTI_FTSR_TR9_Pos)                       /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR9                            EXTI_FTSR_TR9_Msk
#define  EXTI_FTSR_TR10_Pos                       (10)
#define  EXTI_FTSR_TR10_Msk                       (0x1U << EXTI_FTSR_TR10_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR10                           EXTI_FTSR_TR10_Msk
#define  EXTI_FTSR_TR11_Pos                       (11)
#define  EXTI_FTSR_TR11_Msk                       (0x1U << EXTI_FTSR_TR11_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR11                           EXTI_FTSR_TR11_Msk
#define  EXTI_FTSR_TR12_Pos                       (12)
#define  EXTI_FTSR_TR12_Msk                       (0x1U << EXTI_FTSR_TR12_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR12                           EXTI_FTSR_TR12_Msk
#define  EXTI_FTSR_TR13_Pos                       (13)
#define  EXTI_FTSR_TR13_Msk                       (0x1U << EXTI_FTSR_TR13_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR13                           EXTI_FTSR_TR13_Msk
#define  EXTI_FTSR_TR14_Pos                       (14)
#define  EXTI_FTSR_TR14_Msk                       (0x1U << EXTI_FTSR_TR14_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR14                           EXTI_FTSR_TR14_Msk
#define  EXTI_FTSR_TR15_Pos                       (15)
#define  EXTI_FTSR_TR15_Msk                       (0x1U << EXTI_FTSR_TR15_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR15                           EXTI_FTSR_TR15_Msk
#define  EXTI_FTSR_TR16_Pos                       (16)
#define  EXTI_FTSR_TR16_Msk                       (0x1U << EXTI_FTSR_TR16_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR16                           EXTI_FTSR_TR16_Msk
#define  EXTI_FTSR_TR17_Pos                       (17)
#define  EXTI_FTSR_TR17_Msk                       (0x1U << EXTI_FTSR_TR17_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR17                           EXTI_FTSR_TR17_Msk
#define  EXTI_FTSR_TR18_Pos                       (18)
#define  EXTI_FTSR_TR18_Msk                       (0x1U << EXTI_FTSR_TR18_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR18                           EXTI_FTSR_TR18_Msk
#define  EXTI_FTSR_TR19_Pos                       (19)
#define  EXTI_FTSR_TR19_Msk                       (0x1U << EXTI_FTSR_TR19_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR19                           EXTI_FTSR_TR19_Msk
#define  EXTI_FTSR_TR20_Pos                       (20)
#define  EXTI_FTSR_TR20_Msk                       (0x1U << EXTI_FTSR_TR20_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR20                           EXTI_FTSR_TR20_Msk
#define  EXTI_FTSR_TR21_Pos                       (21)
#define  EXTI_FTSR_TR21_Msk                       (0x1U << EXTI_FTSR_TR21_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR21                           EXTI_FTSR_TR21_Msk
#define  EXTI_FTSR_TR22_Pos                       (22)
#define  EXTI_FTSR_TR22_Msk                       (0x1U << EXTI_FTSR_TR22_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR22                           EXTI_FTSR_TR22_Msk
#define  EXTI_FTSR_TR23_Pos                       (23)
#define  EXTI_FTSR_TR23_Msk                       (0x1U << EXTI_FTSR_TR23_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR23                           EXTI_FTSR_TR23_Msk
#define  EXTI_FTSR_TR24_Pos                       (24)
#define  EXTI_FTSR_TR24_Msk                       (0x1U << EXTI_FTSR_TR24_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR24                           EXTI_FTSR_TR24_Msk
#define  EXTI_FTSR_TR25_Pos                       (25)
#define  EXTI_FTSR_TR25_Msk                       (0x1U << EXTI_FTSR_TR25_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR25                           EXTI_FTSR_TR25_Msk
#define  EXTI_FTSR_TR26_Pos                       (26)
#define  EXTI_FTSR_TR26_Msk                       (0x1U << EXTI_FTSR_TR26_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR26                           EXTI_FTSR_TR26_Msk
#define  EXTI_FTSR_TR27_Pos                       (27)
#define  EXTI_FTSR_TR27_Msk                       (0x1U << EXTI_FTSR_TR27_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR27                           EXTI_FTSR_TR27_Msk
#define  EXTI_FTSR_TR28_Pos                       (28)
#define  EXTI_FTSR_TR28_Msk                       (0x1U << EXTI_FTSR_TR28_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR28                           EXTI_FTSR_TR28_Msk
#define  EXTI_FTSR_TR29_Pos                       (29)
#define  EXTI_FTSR_TR29_Msk                       (0x1U << EXTI_FTSR_TR29_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR29                           EXTI_FTSR_TR29_Msk
#define  EXTI_FTSR_TR30_Pos                       (30)
#define  EXTI_FTSR_TR30_Msk                       (0x1U << EXTI_FTSR_TR30_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR30                           EXTI_FTSR_TR30_Msk
#define  EXTI_FTSR_TR31_Pos                       (31)
#define  EXTI_FTSR_TR31_Msk                       (0x1U << EXTI_FTSR_TR31_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR31                           EXTI_FTSR_TR31_Msk

